<template>
  <div class="p-5 flex flex-col gap-3">
    <h2>第一则 总则</h2>
    <p>
      （1）平台定位与业务范畴
      本平台旨在为自由职业者及需求方提供一个安全、高效、便捷的线上工作交流与协作平台。业务范围涵盖软件/程序开发、翻译写作、创意设计、数据录入、短视频制作、运营策划、客户服务、远程实习及内容审核等多种远程工作服务。
    </p>
    <p>
      （2）平台的权利与义务
      平台应维护良好的工作环境和秩序，保障用户的合法权益，提供稳定、可靠的技术支持和服务。同时，平台有权对违反规定的行为进行管理和处罚。
    </p>
    <h2>第二则 用户管理</h2>
    <p>
      （3）用户实名认证
      入驻平台的用户需通过登录注册实名认证，提供真实有效的身份证明和相关信息。平台有权对用户的身份信息进行核实，并保留对用户身份信息的保密义务。
    </p>
    <p>
      （4）用户行为规范
      用户在平台上的行为应遵守法律法规、社会公德及平台规定。禁止发布虚假信息、恶意攻击他人、侵犯他人权益等行为。
    </p>
    <h2>第三则 工作内容与要求</h2>
    <p>
      （5）工作内容及要求发布
      发布方应在平台上清晰、准确地发布工作内容及要求，包括工作性质、任务量、完成时间、报酬等关键信息。平台将对发布的信息进行审核，确保其合法性和真实性。
    </p>
    <p>
      （6）工作成果提交与评估
      用户应按照发布方的要求完成工作任务，并按时提交工作成果。发布方应对用户提交的工作成果进行评估，并及时反馈评估结果。
    </p>
    <h2>第四则 资金结算与支付</h2>
    <p>
      （7）资金结算规则
      根据平台制定明确的资金结算规则，包括结算周期、结算方式、税费处理等。用户和发布方应遵守平台的结算规则，确保资金的安全和及时到账。
    </p>
    <p>
      （8）支付安全保障
      平台应采取必要的技术措施和安全管理措施，保障用户及发布方的支付安全。对于因平台原因导致的支付问题，平台应承担相应的责任。
    </p>
    <h2>第五则 知识产权与个人信息保护</h2>
    <p>
      （9）知识产权保护
      用户在平台上发布的作品、创意等成果，其知识产权归用户所有。未经用户许可，其他用户或发布方不得擅自使用、复制、传播或用于商业目的。平台应尊重并保护用户的知识产权，对于侵权行为将采取相应的处理措施。
    </p>
    <p>
      （10）个人信息保护
      平台将严格遵守《中华人民共和国个人信息保护法》的规定，对用户的个人信息进行收集、使用、存储和保护。未经用户明确同意，平台不得将用户的个人信息泄露给第三方或用于其他用途。
    </p>
    <h2>第六则 纠纷解决与法律责任</h2>
    <p>
      （11）纠纷解决机制
      对于平台上发生的纠纷，双方应首先通过友好协商解决。如协商无果，可向平台提出投诉或申请调解。平台将设立专门的纠纷解决机构，负责处理用户的投诉和纠纷。
    </p>
    <p>
      （12）法律责任
      对于违反平台规定或法律法规的行为，平台有权采取相应的处罚措施，包括但不限于警告、限制功能、冻结账号、解除合作等。对于严重违法行为，平台将依法追究相关责任人的法律责任。
    </p>
    <h2>附则</h2>
    <p>
      （13）其他规定
      本平台法律条文未尽事宜，参照《中华人民共和国合同法》或《中华人民共和国民法典》合同编、《中华人民共和国著作权法》、《中华人民共和国专利法》、《中华人民共和国劳动法》、《中华人民共和国网络安全法》等相关法律法规执行。
    </p>
    <p>
      （14）解释权与修订权
      本法律条文的解释权归简易通平台所有。平台有权根据业务发展需要和法律法规的变化，对本法律条文进行修订和更新。修订后的法律条文将在平台上公示，自公示之日起生效。
    </p>

  </div>
</template>

<style scoped>
p {
  font-weight: 300;
}
</style>