<template>
  <div class="p-5 flex flex-col gap-3">
    <h2>第一则 前言</h2>
    <p>我们非常重视用户的隐私保护。本隐私政策旨在向用户明确说明平台如何收集、使用、存储和保护用户的个人信息，以便用户能够充分了解并信任我们的服务。请用户在使用平台服务前，仔细阅读本隐私政策，确保您充分理解并同意我们的隐私保护措施。</p>
    <h2>第二则 信息收集</h2>
    <p>
      注册信息：当用户注册平台账号时，我们需要收集用户的姓名、手机号码、电子邮箱等基本信息。这些信息用于验证用户身份，确保账号安全，并提供个性化服务。
      使用信息：在用户使用平台服务过程中，我们会收集用户的设备信息、IP地址、浏览记录、搜索记录、操作日志等数据。这些信息有助于我们优化平台功能，提升用户体验，以及进行数据分析。
    </p>
    <p>支付信息：当用户进行付费服务时，我们需要收集用户的支付信息，如银行卡号等。这些信息将通过安全的支付渠道进行处理。</p>
    <h2>第三则 信息使用</h2>
    <p>提供服务：我们会使用您的个人信息来提供平台服务，包括发布职位信息、匹配求职者、提供在线沟通等。</p>
    <p>优化体验：根据您的使用习惯、兴趣偏好等信息，我们会为您提供个性化的推荐和服务，提升用户体验。</p>
    <p>数据分析：我们会对您数据进行统计分析，以了解用户需求和平台运营状况，为改进产品和服务提供依据。</p>
    <h2>第四则 信息存储与保护</h2>
    <p>数据存储：我们采用技术手段，确保用户信息的安全存储。用户的个人信息将存储在安全的服务器上，并采取加密措施防止数据泄露。如端对端加密：端对端加密是一种保证数据在传输过程中始终保持加密状态的技术。在端对端加密中，只有发送方和接收方能够解密数据，而中间的网络设备和服务器都无法获取到明文数据。这种加密方式广泛应用于即时通讯、电子邮件、文件传输等领域，有效保护了用户的隐私安全。</p>
    <p>数据备份：我们定期对用户数据进行备份，以防止数据丢失或损坏。</p>
    <p>访问控制：我们严格控制对用户信息的访问权限，只有经过授权的人员才能访问用户的个人信息。</p>
    <h2>第五则 信息共享与披露</h2>
    <p>共享范围：我们不会将用户的个人信息无故共享给第三方。仅在以下情况下，我们可能会与第三方共享用户信息：</p>
    <ul>
      <li>（1）用户明确同意的情况下；</li>
      <li>（2）合作伙伴为提供服务而需要获取用户信息的情况下；</li>
      <li>（3）法律法规要求的情况下。</li>
    </ul>
    <p>披露义务：在法律法规要求或司法、行政机关依法要求的情况下，我们可能会披露用户的个人信息。</p>
    <h2>第六则 用户权利</h2>
    <p>查询与修改：用户有权查询自己的个人信息，并可以修改部分信息。用户可以通过平台提供的途径进行修改操作。</p>
    <p>删除与注销：用户有权要求删除自己的个人信息，并可以注销平台账号。用户可以通过平台提供的途径进行删除和注销操作。</p>
    <p>投诉与举报：如果用户认为平台在个人信息处理方面存在违法行为，可以向我们投诉或举报。我们将尽快处理用户的投诉和举报，并保护用户的合法权益。</p>
    <h2>第七则 变更与更新</h2>
    <p>本隐私政策可能会根据法律法规的变化、平台业务的发展等因素进行变更和更新。我们会通过平台公告、邮件通知等方式向用户告知隐私政策的变更情况，并请用户及时关注并了解最新的隐私政策内容。</p>
    <h2>附则</h2>
    <p>本隐私政策自发布之日起生效，并适用于所有使用简易通平台的用户。用户在使用平台服务时，即视为同意本隐私政策的内容。如有任何争议，双方应首先通过友好协商解决；协商不成的，可向平台所在地有管辖权的人民法院提起诉讼。</p>
  </div>
</template>

<style scoped>
p {
  font-weight: 300;
}
</style>